open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
/* SPDX-License-Identifier: Apache-2.0 */

#include "bk7258_voice_gateway.h"

#include <assert.h>
#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#define TEST_BUFFER_BYTES 16384u

struct fake_transport_s
{
  uint8_t tx[TEST_BUFFER_BYTES];
  uint8_t rx[TEST_BUFFER_BYTES];
  size_t tx_size;
  size_t rx_size;
  size_t rx_offset;
  size_t send_chunk;
  size_t recv_chunk;
  size_t send_fail_after;
  int send_error;
  int empty_recv_error;
  int open_error;
  int interrupt_error;
  int close_failures;
  int close_error;
  int open_calls;
  int send_calls;
  int recv_calls;
  int interrupt_calls;
  int close_calls;
  uint64_t open_deadline;
  uint64_t send_deadline;
  uint64_t recv_deadline;
  bool send_zero_once;
  bool opened;
};

struct fake_audio_s
{
  int mic_acquire_calls;
  int mic_prepare_calls;
  int mic_start_calls;
  int mic_stop_calls;
  int mic_drain_calls;
  int mic_release_calls;
  int dac_acquire_calls;
  int dac_prepare_calls;
  int dac_start_calls;
  int dac_write_calls;
  int dac_drain_calls;
  int dac_stop_calls;
  int dac_release_calls;
  size_t dac_bytes;
  ssize_t dac_write_result;
  bool dac_write_result_set;
};

struct fake_owner_s
{
  struct bkvoice_turn_s *turn;
  int tts_start_calls;
  int tts_audio_calls;
  int tts_end_calls;
  int terminal_calls;
  int terminal_reason;
  uint32_t terminal_session_id;
  uint32_t terminal_turn_id;
  int volume_error;
  unsigned int volume;
  unsigned int requested_volume;
  int ota_calls;
  int ota_error;
  uint32_t ota_request_sequence;
  uint8_t ota_digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES];
};

struct fake_clock_s
{
  uint64_t now_ms;
};

struct fixture_s
{
  struct fake_transport_s transport;
  struct fake_audio_s audio;
  struct fake_owner_s owner;
  struct fake_clock_s clock;
  struct bkvoice_turn_s turn;
  struct bkvoice_gateway_s gateway;
  uint32_t session_id;
  uint32_t server_sequence;
};

static size_t test_min_size(size_t left, size_t right)
{
  return left < right ? left : right;
}

static uint32_t test_get_be32(const uint8_t *data)
{
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

static uint16_t test_get_be16(const uint8_t *data)
{
  return ((uint16_t)data[0] << 8) | data[1];
}

static void test_put_be32(uint8_t *data, uint32_t value)
{
  data[0] = (uint8_t)(value >> 24);
  data[1] = (uint8_t)(value >> 16);
  data[2] = (uint8_t)(value >> 8);
  data[3] = (uint8_t)value;
}

static int fake_transport_open(void *context, uint64_t deadline_ms)
{
  struct fake_transport_s *transport = context;

  transport->open_calls++;
  transport->open_deadline = deadline_ms;
  if (transport->open_error < 0)
    {
      return transport->open_error;
    }

  transport->opened = true;
  return 0;
}

static ssize_t fake_transport_send(void *context, const uint8_t *buffer,
                                   size_t bytes, uint64_t deadline_ms)
{
  struct fake_transport_s *transport = context;
  size_t chunk;

  transport->send_calls++;
  transport->send_deadline = deadline_ms;
  if (!transport->opened)
    {
      return -ENOTCONN;
    }

  if (transport->send_zero_once)
    {
      transport->send_zero_once = false;
      return 0;
    }

  if (transport->send_error < 0 &&
      transport->tx_size >= transport->send_fail_after)
    {
      return transport->send_error;
    }

  chunk = test_min_size(bytes, transport->send_chunk);
  if (transport->send_error < 0 &&
      transport->tx_size + chunk > transport->send_fail_after)
    {
      chunk = transport->send_fail_after - transport->tx_size;
    }

  if (chunk == 0)
    {
      return transport->send_error < 0 ? transport->send_error : -EIO;
    }

  if (transport->tx_size + chunk > sizeof(transport->tx))
    {
      return -ENOSPC;
    }

  memcpy(transport->tx + transport->tx_size, buffer, chunk);
  transport->tx_size += chunk;
  return (ssize_t)chunk;
}

static ssize_t fake_transport_recv(void *context, uint8_t *buffer,
                                   size_t bytes, uint64_t deadline_ms)
{
  struct fake_transport_s *transport = context;
  size_t available;
  size_t chunk;

  transport->recv_calls++;
  transport->recv_deadline = deadline_ms;
  if (!transport->opened)
    {
      return -ENOTCONN;
    }

  available = transport->rx_size - transport->rx_offset;
  if (available == 0)
    {
      return transport->empty_recv_error;
    }

  chunk = test_min_size(bytes, transport->recv_chunk);
  chunk = test_min_size(chunk, available);
  memcpy(buffer, transport->rx + transport->rx_offset, chunk);
  transport->rx_offset += chunk;
  return (ssize_t)chunk;
}

static int fake_transport_interrupt(void *context)
{
  struct fake_transport_s *transport = context;

  transport->interrupt_calls++;
  return transport->interrupt_error;
}

static int fake_transport_close(void *context)
{
  struct fake_transport_s *transport = context;

  transport->close_calls++;
  if (transport->close_failures > 0)
    {
      transport->close_failures--;
      return transport->close_error;
    }

  transport->opened = false;
  return 0;
}

static const struct bkvoice_transport_ops_s g_transport_ops =
{
  .open = fake_transport_open,
  .send = fake_transport_send,
  .recv = fake_transport_recv,
  .interrupt = fake_transport_interrupt,
  .close = fake_transport_close,
};

static int fake_mic_acquire(void *context)
{
  ((struct fake_audio_s *)context)->mic_acquire_calls++;
  return 0;
}

static int fake_mic_prepare(void *context)
{
  ((struct fake_audio_s *)context)->mic_prepare_calls++;
  return 0;
}

static int fake_mic_start(void *context)
{
  ((struct fake_audio_s *)context)->mic_start_calls++;
  return 0;
}

static int fake_mic_stop(void *context)
{
  ((struct fake_audio_s *)context)->mic_stop_calls++;
  return 0;
}

static int fake_mic_drain(void *context)
{
  ((struct fake_audio_s *)context)->mic_drain_calls++;
  return 0;
}

static int fake_mic_release(void *context)
{
  ((struct fake_audio_s *)context)->mic_release_calls++;
  return 0;
}

