open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
static int fake_dac_acquire(void *context)
{
  ((struct fake_audio_s *)context)->dac_acquire_calls++;
  return 0;
}

static int fake_dac_prepare(void *context)
{
  ((struct fake_audio_s *)context)->dac_prepare_calls++;
  return 0;
}

static int fake_dac_start(void *context)
{
  ((struct fake_audio_s *)context)->dac_start_calls++;
  return 0;
}

static ssize_t fake_dac_write(void *context, const uint8_t *pcm,
                              size_t bytes)
{
  struct fake_audio_s *audio = context;
  ssize_t written;

  assert(pcm != NULL);
  audio->dac_write_calls++;
  written = audio->dac_write_result_set ? audio->dac_write_result :
            (ssize_t)bytes;
  if (written > 0)
    {
      audio->dac_bytes += (size_t)written;
    }

  return written;
}

static int fake_dac_drain(void *context)
{
  ((struct fake_audio_s *)context)->dac_drain_calls++;
  return 0;
}

static int fake_dac_stop(void *context)
{
  ((struct fake_audio_s *)context)->dac_stop_calls++;
  return 0;
}

static int fake_dac_release(void *context)
{
  ((struct fake_audio_s *)context)->dac_release_calls++;
  return 0;
}

static const struct bkvoice_turn_audio_ops_s g_audio_ops =
{
  .mic_acquire = fake_mic_acquire,
  .mic_prepare = fake_mic_prepare,
  .mic_start = fake_mic_start,
  .mic_stop = fake_mic_stop,
  .mic_drain = fake_mic_drain,
  .mic_release = fake_mic_release,
  .dac_acquire = fake_dac_acquire,
  .dac_prepare = fake_dac_prepare,
  .dac_start = fake_dac_start,
  .dac_write = fake_dac_write,
  .dac_drain = fake_dac_drain,
  .dac_stop = fake_dac_stop,
  .dac_release = fake_dac_release,
};

static int fake_owner_tts_start(
  void *context, const struct bkvoice_turn_token_s *token, uint64_t now_ms)
{
  struct fake_owner_s *owner = context;

  owner->tts_start_calls++;
  return bkvoice_turn_tts_start(owner->turn, token, now_ms);
}

static int fake_owner_tts_audio(
  void *context, const struct bkvoice_turn_token_s *token,
  const uint8_t *pcm, size_t bytes, uint64_t now_ms)
{
  struct fake_owner_s *owner = context;

  owner->tts_audio_calls++;
  return bkvoice_turn_tts_audio(owner->turn, token, pcm, bytes, now_ms);
}

static int fake_owner_tts_end(
  void *context, const struct bkvoice_turn_token_s *token)
{
  struct fake_owner_s *owner = context;

  owner->tts_end_calls++;
  return bkvoice_turn_tts_end(owner->turn, token);
}

static int fake_owner_terminal(void *context, uint32_t session_id,
                               uint32_t turn_id, int reason)
{
  struct fake_owner_s *owner = context;
  struct bkvoice_turn_token_s token;

  owner->terminal_calls++;
  owner->terminal_session_id = session_id;
  owner->terminal_turn_id = turn_id;
  owner->terminal_reason = reason;
  if (owner->turn->state == BKVOICE_TURN_IDLE ||
      owner->turn->state == BKVOICE_TURN_FAULTED)
    {
      return 0;
    }

  token = owner->turn->active;
  token.sequence = owner->turn->last_control_sequence + 1u;
  return bkvoice_turn_cancel(owner->turn, &token, reason);
}

static const struct bkvoice_gateway_downlink_ops_s g_downlink_ops =
{
  .tts_start = fake_owner_tts_start,
  .tts_audio = fake_owner_tts_audio,
  .tts_end = fake_owner_tts_end,
  .terminal = fake_owner_terminal,
};

static uint64_t fake_now_ms(void *context)
{
  return ((struct fake_clock_s *)context)->now_ms;
}

static void fake_transport_initialize(struct fake_transport_s *transport)
{
  memset(transport, 0, sizeof(*transport));
  transport->send_chunk = 13;
  transport->recv_chunk = 7;
  transport->send_fail_after = SIZE_MAX;
  transport->empty_recv_error = -EAGAIN;
  transport->close_error = -EIO;
}

static void fake_enqueue_server_frame(
  struct fixture_s *fixture, uint8_t type, uint16_t flags,
  uint32_t turn_id, uint32_t sequence,
  const uint8_t *payload, uint32_t payload_len)
{
  struct bkvoice_companion_header_s header;
  uint8_t frame[BKVOICE_GATEWAY_FRAME_BYTES];
  size_t frame_size;

  memset(&header, 0, sizeof(header));
  header.magic = BKVOICE_COMPANION_MAGIC;
  header.version = BKVOICE_COMPANION_VERSION;
  header.type = type;
  header.flags = flags;
  header.header_len = BKVOICE_COMPANION_HEADER_BYTES;
  header.payload_len = payload_len;
  header.boot_generation = 7;
  header.session_id = fixture->session_id;
  header.turn_id = turn_id;
  header.sequence = sequence;
  header.timestamp_ms = fixture->clock.now_ms;
  assert(bkvoice_companion_encode(&header, payload, frame, sizeof(frame),
                                  &frame_size) == 0);
  assert(fixture->transport.rx_size + frame_size <=
         sizeof(fixture->transport.rx));
  memcpy(fixture->transport.rx + fixture->transport.rx_size, frame,
         frame_size);
  fixture->transport.rx_size += frame_size;
}

static void fixture_enqueue_server(
  struct fixture_s *fixture, uint8_t type, uint16_t flags,
  uint32_t turn_id, const uint8_t *payload, uint32_t payload_len)
{
  fixture->server_sequence++;
  fake_enqueue_server_frame(fixture, type, flags, turn_id,
                            fixture->server_sequence, payload, payload_len);
}

static int fake_volume(void *context, bool set, unsigned int requested,
                        unsigned int *observed)
{
  struct fake_owner_s *owner = context;
  if (set)
    {
      owner->requested_volume = requested;
    }

  *observed = owner->volume;
  return owner->volume_error;
}

static int fake_ota_request(
  void *context, uint32_t request_sequence,
  const uint8_t digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES])
{
  struct fake_owner_s *owner = context;

  owner->ota_calls++;
  owner->ota_request_sequence = request_sequence;
  memcpy(owner->ota_digest, digest, sizeof(owner->ota_digest));
  return owner->ota_error;
}

static void fixture_initialize_options(struct fixture_s *fixture,
                                       uint32_t uplink_credit,
                                       uint32_t downlink_credit, bool volume,
                                       bool ota)
{
  struct bkvoice_gateway_downlink_ops_s ops = g_downlink_ops;
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_gateway_config_s gateway_config =
  {
    .io_timeout_ms = 50,
  };
  struct bkvoice_turn_limits_s turn_limits =
  {
    .capture_timeout_ms = 1000,
    .waiting_tts_timeout_ms = 1000,
    .playback_timeout_ms = 1000,
    .audio_frame_bytes = BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
  };
  uint8_t window[sizeof(uint32_t)];

  memset(fixture, 0, sizeof(*fixture));
  fake_transport_initialize(&fixture->transport);
  fixture->clock.now_ms = 100;
  fixture->owner.turn = &fixture->turn;
  ops.volume = volume ? fake_volume : NULL;
  gateway_config.ota_request = ota ? fake_ota_request : NULL;
  gateway_config.ota_context = ota ? &fixture->owner : NULL;
  assert(bkvoice_turn_initialize(&fixture->turn, &g_audio_ops,
                                 &fixture->audio, &turn_limits, 7) == 0);
  assert(bkvoice_gateway_initialize(
           &fixture->gateway, &g_transport_ops, &fixture->transport,
           &ops, &fixture->owner, fake_now_ms, &fixture->clock,
           &gateway_config, 7) == 0);
  assert(bkvoice_gateway_connect(&fixture->gateway, 500) == 0);
  assert(fixture->transport.open_deadline == 500);

