open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
  bkvoice_gateway_snapshot(&fixture->gateway, &snapshot);
  fixture->session_id = snapshot.session_id;
  assert(fixture->session_id == 1);
  assert(snapshot.companion_state == BKVOICE_COMPANION_HELLO_SENT);

  fixture_enqueue_server(fixture, BKVOICE_COMPANION_WELCOME, 0, 0,
                         NULL, 0);
  assert(bkvoice_gateway_receive_one(&fixture->gateway, 600) == 0);
  assert(bkvoice_turn_session_open(&fixture->turn,
                                   fixture->session_id) == 0);

  test_put_be32(window, uplink_credit);
  fixture_enqueue_server(fixture, BKVOICE_COMPANION_WINDOW_UPDATE, 0, 0,
                         window, sizeof(window));
  assert(bkvoice_gateway_receive_one(&fixture->gateway, 601) == 0);
  assert(bkvoice_gateway_grant_downlink(&fixture->gateway,
                                        downlink_credit) == 0);
}

static void fixture_initialize_volume(struct fixture_s *fixture,
                                      uint32_t uplink_credit,
                                      uint32_t downlink_credit, bool volume)
{
  fixture_initialize_options(fixture, uplink_credit, downlink_credit, volume,
                             false);
}

static void fixture_initialize_ota(struct fixture_s *fixture,
                                   uint32_t uplink_credit,
                                   uint32_t downlink_credit)
{
  fixture_initialize_options(fixture, uplink_credit, downlink_credit, false,
                             true);
}

static void fixture_initialize(struct fixture_s *fixture,
                               uint32_t uplink_credit,
                               uint32_t downlink_credit)
{
  fixture_initialize_volume(fixture, uplink_credit, downlink_credit, false);
}

static void fixture_finish(struct fixture_s *fixture)
{
  assert(fixture->turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_turn_session_close(&fixture->turn, -ENOTCONN) == 0);
  assert(bkvoice_gateway_disconnect(&fixture->gateway, -ENOTCONN) == 0);
  assert(bkvoice_gateway_uninitialize(&fixture->gateway) == 0);
}

static struct bkvoice_companion_header_s fake_tx_header(
  const struct fake_transport_s *transport, size_t index)
{
  struct bkvoice_companion_header_s header;
  const uint8_t *payload;
  size_t offset = 0;
  size_t frame_size;
  size_t current;

  for (current = 0; current <= index; current++)
    {
      assert(offset + BKVOICE_COMPANION_HEADER_BYTES <= transport->tx_size);
      frame_size = BKVOICE_COMPANION_HEADER_BYTES +
                   test_get_be32(transport->tx + offset + 12);
      assert(offset + frame_size <= transport->tx_size);
      if (current == index)
        {
          assert(bkvoice_companion_decode(transport->tx + offset,
                                          frame_size, &header,
                                          &payload) == 0);
          return header;
        }

      offset += frame_size;
    }

  assert(false);
  memset(&header, 0, sizeof(header));
  return header;
}

static uint32_t fake_tx_window_credit(
  const struct fake_transport_s *transport, size_t index)
{
  struct bkvoice_companion_header_s header;
  size_t offset = 0;
  size_t frame_size;
  size_t current;

  for (current = 0; current <= index; current++)
    {
      assert(offset + BKVOICE_COMPANION_HEADER_BYTES <= transport->tx_size);
      frame_size = BKVOICE_COMPANION_HEADER_BYTES +
                   test_get_be32(transport->tx + offset + 12);
      assert(offset + frame_size <= transport->tx_size);
      if (current == index)
        {
          header = fake_tx_header(transport, index);
          assert(header.type == BKVOICE_COMPANION_WINDOW_UPDATE);
          assert(header.payload_len == sizeof(uint32_t));
          return test_get_be32(
            transport->tx + offset + BKVOICE_COMPANION_HEADER_BYTES);
        }

      offset += frame_size;
    }

  assert(false);
  return 0;
}

static void test_transport_guards(void)
{
  struct fake_transport_s fake;
  struct bkvoice_transport_s transport;
  struct bkvoice_transport_ops_s bad_ops = g_transport_ops;
  uint8_t byte = 1;

  fake_transport_initialize(&fake);
  bad_ops.close = NULL;
  assert(bkvoice_transport_initialize(&transport, &bad_ops, &fake) ==
         -EINVAL);
  assert(bkvoice_transport_initialize(&transport, &g_transport_ops,
                                      &fake) == 0);
  assert(bkvoice_transport_send_all(&transport, &byte, 1, 1) ==
         -ENOTCONN);
  assert(bkvoice_transport_open(&transport, 10) == 0);
  assert(bkvoice_transport_open(&transport, 10) == -EALREADY);
  fake.send_zero_once = true;
  assert(bkvoice_transport_send_all(&transport, &byte, 1, 11) == -EPIPE);
  fake.empty_recv_error = 0;
  assert(bkvoice_transport_recv_exact(&transport, &byte, 1, 12) ==
         -ECONNRESET);
  assert(bkvoice_transport_interrupt(&transport) == 0);
  assert(bkvoice_transport_close(&transport) == 0);
  assert(bkvoice_transport_close(&transport) == 0);
}

static void test_single_turn_vertical(void)
{
  static const uint8_t expected_types[] =
  {
    BKVOICE_COMPANION_HELLO,
    BKVOICE_COMPANION_WINDOW_UPDATE,
    BKVOICE_COMPANION_TURN_START,
    BKVOICE_COMPANION_AUDIO_UP,
    BKVOICE_COMPANION_AUDIO_UP,
    BKVOICE_COMPANION_TURN_END,
    BKVOICE_COMPANION_WINDOW_UPDATE,
  };
  struct bkvoice_gateway_snapshot_s gateway_snapshot;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct bkvoice_companion_header_s header;
  struct fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];
  size_t index;

  memset(audio, 0x5a, sizeof(audio));
  fixture_initialize(&fixture, sizeof(audio) * 2u, sizeof(audio) * 2u);
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == 0);

  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_ptt_up(&fixture.turn, &event,
                             fixture.clock.now_ms) == 0);
  assert(fixture.audio.mic_release_calls == 1);
  assert(bkvoice_gateway_capture_sink_ops()->end(&fixture.gateway,
                                                 &token) == 0);

