open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_START,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         NULL, 0);
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_AUDIO_DOWN,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         audio, sizeof(audio));
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_END,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         NULL, 0);
  struct bkvoice_gateway_frame_s frames[3];
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &frames[0], 700) == 0);
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &frames[1], 701) == 0);
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &frames[2], 702) == 0);
  assert(fixture.owner.tts_start_calls == 0);
  assert(fixture.owner.tts_audio_calls == 0 &&
         fixture.owner.tts_end_calls == 0);
  assert(fixture.owner.terminal_calls == 0);
  assert(fixture.audio.dac_acquire_calls == 0);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &frames[0]) == 0);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &frames[1]) == 0);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &frames[2]) == 0);

  assert(fixture.turn.state == BKVOICE_TURN_IDLE);
  assert(fixture.audio.dac_write_calls == 1);
  assert(fixture.audio.dac_bytes == sizeof(audio));
  assert(fixture.audio.dac_release_calls == 1);
  assert(fixture.owner.tts_start_calls == 1);
  assert(fixture.owner.tts_audio_calls == 1);
  assert(fixture.owner.tts_end_calls == 1);
  assert(fixture.owner.terminal_calls == 0);

  bkvoice_gateway_snapshot(&fixture.gateway, &gateway_snapshot);
  assert(gateway_snapshot.companion_state == BKVOICE_COMPANION_IDLE);
  assert(gateway_snapshot.tx_frames == 7);
  assert(gateway_snapshot.rx_frames == 5);
  assert(gateway_snapshot.downlink_sequence == 3);
  assert(gateway_snapshot.tx_window == 0);
  assert(gateway_snapshot.rx_window == sizeof(audio) * 2u);
  assert(!gateway_snapshot.faulted);
  assert(fixture.transport.send_calls > (int)gateway_snapshot.tx_frames);
  assert(fixture.transport.recv_calls > (int)gateway_snapshot.rx_frames);
  assert(fixture.transport.send_deadline ==
         fixture.clock.now_ms + 50);
  assert(fixture.transport.recv_deadline == 702);

  for (index = 0; index < sizeof(expected_types); index++)
    {
      header = fake_tx_header(&fixture.transport, index);
      assert(header.type == expected_types[index]);
      assert(header.sequence == index + 1u);
    }

  fixture_finish(&fixture);
}

static void test_downlink_credit_replenished_after_dac_accept(void)
{
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];
  size_t index;

  memset(audio, 0x69, sizeof(audio));
  fixture_initialize(&fixture, sizeof(audio), sizeof(audio));
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_ptt_up(&fixture.turn, &event,
                             fixture.clock.now_ms) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->end(&fixture.gateway,
                                                 &token) == 0);

  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_START,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         NULL, 0);
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 700) == 0);
  for (index = 0; index < 6; index++)
    {
      fixture_enqueue_server(&fixture, BKVOICE_COMPANION_AUDIO_DOWN,
                             BKVOICE_COMPANION_FLAG_SYNTHETIC,
                             token.turn_id, audio, sizeof(audio));
      assert(bkvoice_gateway_receive_one(&fixture.gateway, 701 + index) == 0);
      bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
      assert(snapshot.rx_window == sizeof(audio));
      assert(fixture.audio.dac_write_calls == (int)index + 1);
      assert(fake_tx_window_credit(&fixture.transport, 4 + index) ==
             sizeof(audio));
    }

  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_END,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         NULL, 0);
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 707) == 0);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.companion_state == BKVOICE_COMPANION_IDLE);
  assert(snapshot.tx_frames == 10);
  assert(snapshot.rx_frames == 10);
  assert(snapshot.downlink_sequence == 8);
  assert(snapshot.rx_window == sizeof(audio));
  assert(!snapshot.faulted);
  fixture_finish(&fixture);
}

static void test_rejected_downlink_does_not_replenish_credit(void)
{
  struct bkvoice_gateway_snapshot_s before;
  struct bkvoice_gateway_snapshot_s after;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];
  size_t tx_size;

  memset(audio, 0x52, sizeof(audio));
  fixture_initialize(&fixture, sizeof(audio), sizeof(audio));
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_ptt_up(&fixture.turn, &event,
                             fixture.clock.now_ms) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->end(&fixture.gateway,
                                                 &token) == 0);
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_START,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         NULL, 0);
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 800) == 0);

  bkvoice_gateway_snapshot(&fixture.gateway, &before);
  tx_size = fixture.transport.tx_size;
  fixture.audio.dac_write_result_set = true;
  fixture.audio.dac_write_result = (ssize_t)sizeof(audio) - 1;
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_AUDIO_DOWN,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         audio, sizeof(audio));
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 801) == -EIO);
  bkvoice_gateway_snapshot(&fixture.gateway, &after);
  assert(fixture.transport.tx_size == tx_size);
  assert(after.tx_frames == before.tx_frames);
  assert(after.faulted);
  assert(fixture.audio.dac_write_calls == 1);
  assert(fixture.audio.dac_bytes == sizeof(audio) - 1u);
  assert(fixture.owner.terminal_calls == 1);
  assert(fixture.turn.state == BKVOICE_TURN_IDLE);
  fixture_finish(&fixture);
}

static void test_downlink_credit_send_failure_faults_session(void)
{
  struct bkvoice_gateway_snapshot_s before;
  struct bkvoice_gateway_snapshot_s after;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];
  size_t tx_size;

  memset(audio, 0x27, sizeof(audio));
  fixture_initialize(&fixture, sizeof(audio), sizeof(audio));
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_ptt_up(&fixture.turn, &event,
                             fixture.clock.now_ms) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->end(&fixture.gateway,
                                                 &token) == 0);
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_START,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         NULL, 0);
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 900) == 0);

  bkvoice_gateway_snapshot(&fixture.gateway, &before);
  tx_size = fixture.transport.tx_size;
  fixture.transport.send_fail_after = tx_size + 9u;
  fixture.transport.send_error = -EIO;
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_AUDIO_DOWN,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
                         audio, sizeof(audio));
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 901) == -EIO);
  bkvoice_gateway_snapshot(&fixture.gateway, &after);
  assert(after.faulted);
  assert(after.companion_state == BKVOICE_COMPANION_DISCONNECTED);
  assert(after.tx_frames == before.tx_frames);
  assert(fixture.transport.tx_size == tx_size + 9u);
  assert(fixture.audio.dac_write_calls == 1);
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == -ENOTCONN);

  assert(bkvoice_turn_session_close(&fixture.turn, -EIO) == 0);
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -EIO) == 0);
  assert(bkvoice_gateway_uninitialize(&fixture.gateway) == 0);
}

static void test_backpressure_retry_and_local_cancel(void)
{
  struct bkvoice_gateway_snapshot_s before;
  struct bkvoice_gateway_snapshot_s after;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct bkvoice_companion_header_s header;
  struct fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];
  uint8_t window[sizeof(uint32_t)];
  size_t tx_size;

