open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
  memset(audio, 0x33, sizeof(audio));
  fixture_initialize(&fixture, sizeof(audio), sizeof(audio));
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == 0);
  bkvoice_gateway_snapshot(&fixture.gateway, &before);
  tx_size = fixture.transport.tx_size;
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == -EAGAIN);
  bkvoice_gateway_snapshot(&fixture.gateway, &after);
  assert(fixture.transport.tx_size == tx_size);
  assert(after.tx_sequence == before.tx_sequence);
  assert(!after.faulted);

  test_put_be32(window, sizeof(audio));
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_WINDOW_UPDATE, 0,
                         token.turn_id, window, sizeof(window));
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 800) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->cancel(
           &fixture.gateway, &token, -ECANCELED) == 0);

  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_cancel(&fixture.turn, &event, -ECANCELED) == 0);
  header = fake_tx_header(&fixture.transport, 5);
  assert(header.type == BKVOICE_COMPANION_CANCEL);
  fixture_finish(&fixture);
}

static void test_remote_cancel_dispatch(void)
{
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct fixture_s fixture;

  fixture_initialize(&fixture, BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
                     BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_ptt_up(&fixture.turn, &event,
                             fixture.clock.now_ms) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->end(&fixture.gateway,
                                                 &token) == 0);

  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_CANCEL, 0,
                         token.turn_id, NULL, 0);
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 900) == 0);
  assert(fixture.owner.terminal_calls == 1);
  assert(fixture.owner.terminal_reason == -ECANCELED);
  assert(fixture.turn.state == BKVOICE_TURN_IDLE);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.companion_state == BKVOICE_COMPANION_IDLE);
  assert(!snapshot.faulted);
  fixture_finish(&fixture);
}

static void test_partial_send_failure_and_close_retry(void)
{
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];

  memset(audio, 0x77, sizeof(audio));
  fixture_initialize(&fixture, sizeof(audio), sizeof(audio));
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  fixture.transport.send_fail_after = fixture.transport.tx_size + 9u;
  fixture.transport.send_error = -EIO;
  assert(bkvoice_gateway_capture_sink_ops()->audio(
           &fixture.gateway, &token, audio, sizeof(audio)) == -EIO);
  assert(bkvoice_gateway_capture_sink_ops()->cancel(
           &fixture.gateway, &token, -EIO) == 0);

  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.faulted);
  assert(snapshot.companion_state == BKVOICE_COMPANION_DISCONNECTED);
  assert(snapshot.transport.opened);
  assert(fixture.transport.interrupt_calls == 1);
  assert(fixture.owner.terminal_calls == 0);

  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_cancel(&fixture.turn, &event, -EIO) == 0);
  assert(bkvoice_turn_session_close(&fixture.turn, -EIO) == 0);
  fixture.transport.close_failures = 1;
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -EIO) == -EIO);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.transport.opened);
  assert(snapshot.faulted);
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -EIO) == 0);
  assert(bkvoice_gateway_uninitialize(&fixture.gateway) == 0);
}

static void test_sequence_gap_and_receive_timeout_fail_closed(void)
{
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_token_s token;
  struct fixture_s fixture;

  fixture_initialize(&fixture, BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
                     BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  assert(bkvoice_turn_ptt_down(&fixture.turn, fixture.session_id, 1,
                               fixture.clock.now_ms, &token) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->start(&fixture.gateway,
                                                   &token) == 0);
  event = token;
  event.sequence = 2;
  assert(bkvoice_turn_ptt_up(&fixture.turn, &event,
                             fixture.clock.now_ms) == 0);
  assert(bkvoice_gateway_capture_sink_ops()->end(&fixture.gateway,
                                                 &token) == 0);

  fake_enqueue_server_frame(
    &fixture, BKVOICE_COMPANION_TTS_START,
    BKVOICE_COMPANION_FLAG_SYNTHETIC, token.turn_id,
    fixture.server_sequence + 2u, NULL, 0);
  struct bkvoice_gateway_frame_s bad_sequence;
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &bad_sequence,
                                        1000) == 0);
  assert(fixture.owner.terminal_calls == 0);
  assert(!fixture.gateway.faulted);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &bad_sequence) ==
         -EPROTO);
  assert(fixture.owner.terminal_calls == 1);
  assert(fixture.owner.terminal_session_id == fixture.session_id);
  assert(fixture.owner.terminal_turn_id == token.turn_id);
  assert(fixture.turn.state == BKVOICE_TURN_IDLE);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.faulted);
  assert(snapshot.companion_state == BKVOICE_COMPANION_DISCONNECTED);
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -EPROTO) == 0);
  assert(bkvoice_turn_session_close(&fixture.turn, -EPROTO) == 0);
  assert(bkvoice_gateway_uninitialize(&fixture.gateway) == 0);

