open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
  fixture_initialize(&fixture, BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
                     BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  fixture.transport.empty_recv_error = -ETIMEDOUT;
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 1100) ==
         -ETIMEDOUT);
  assert(fixture.transport.recv_deadline == 1100);
  assert(fixture.transport.interrupt_calls == 1);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.faulted);
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -ETIMEDOUT) == 0);
  assert(bkvoice_turn_session_close(&fixture.turn, -ETIMEDOUT) == 0);
  assert(bkvoice_gateway_uninitialize(&fixture.gateway) == 0);
}

static void test_split_stale_frames_and_generation_limit(void)
{
  struct fixture_s fixture;
  struct bkvoice_gateway_frame_s old_frame;
  struct bkvoice_gateway_frame_s old_error;
  struct bkvoice_gateway_frame_s welcome;
  struct bkvoice_gateway_snapshot_s snapshot;
  uint8_t credit[4];
  uint32_t generation;
  int opens;
  int interrupts;

  fixture_initialize(&fixture, BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
                      BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  generation = fixture.gateway.connection_generation;
  assert(generation == 1);
  test_put_be32(credit, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_WINDOW_UPDATE,
                           0, 0, credit, sizeof(credit));
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &old_frame, 800) == 0);
  fixture.transport.empty_recv_error = -ETIMEDOUT;
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &old_error, 801) ==
         -ETIMEDOUT);
  assert(old_error.error == -ETIMEDOUT && old_error.size == 0);
  assert(old_frame.generation == generation &&
         old_error.generation == generation);
  assert(!fixture.gateway.faulted && fixture.owner.terminal_calls == 0);
  assert(fixture.transport.interrupt_calls == 0);

  assert(bkvoice_turn_session_close(&fixture.turn, -ENOTCONN) == 0);
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -ENOTCONN) == 0);
  fixture.transport.open_error = -EIO;
  assert(bkvoice_gateway_connect(&fixture.gateway, 900) == -EIO);
  assert(fixture.gateway.connection_generation == generation);
  fixture.transport.open_error = 0;
  assert(bkvoice_gateway_connect(&fixture.gateway, 901) == 0);
  assert(fixture.gateway.connection_generation == generation + 1);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  fixture.session_id = snapshot.session_id;
  fixture.server_sequence = 0;
  interrupts = fixture.transport.interrupt_calls;

  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &old_frame) ==
         -ESTALE);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &old_error) ==
         -ESTALE);
  assert(!fixture.gateway.faulted && fixture.owner.terminal_calls == 0);
  assert(fixture.transport.interrupt_calls == interrupts);
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_WELCOME, 0, 0, NULL, 0);
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &welcome, 902) == 0);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &welcome) == 0);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &old_error) ==
         -ESTALE);
  assert(!fixture.gateway.faulted);
  assert(bkvoice_turn_session_open(&fixture.turn, fixture.session_id) == 0);
  assert(bkvoice_turn_session_close(&fixture.turn, -ENOTCONN) == 0);
  assert(bkvoice_gateway_disconnect(&fixture.gateway, -ENOTCONN) == 0);

  fixture.gateway.connection_generation = UINT32_MAX;
  opens = fixture.transport.open_calls;
  assert(bkvoice_gateway_connect(&fixture.gateway, 903) == -EOVERFLOW);
  assert(fixture.transport.open_calls == opens);
  assert(fixture.gateway.connection_generation == UINT32_MAX);
  assert(bkvoice_gateway_uninitialize(&fixture.gateway) == 0);
}

static void test_split_length_error_is_deferred(void)
{
  struct fixture_s fixture;
  struct bkvoice_gateway_frame_s frame;
  struct bkvoice_gateway_frame_s malformed;
  size_t offset;

  fixture_initialize(&fixture, BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
                      BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  offset = fixture.transport.rx_size;
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_WELCOME,
                           0, 0, NULL, 0);
  test_put_be32(fixture.transport.rx + offset + 12,
                BKVOICE_GATEWAY_MAX_PAYLOAD + 1);
  assert(bkvoice_gateway_receive_frame(&fixture.gateway, &frame, 800) ==
         -EMSGSIZE);
  assert(frame.error == -EMSGSIZE && frame.size == 0);
  assert(!fixture.gateway.faulted && fixture.transport.interrupt_calls == 0);
  assert(fixture.owner.terminal_calls == 0);
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &frame) ==
         -EMSGSIZE);
  assert(fixture.gateway.faulted && fixture.transport.interrupt_calls == 1);
  fixture_finish(&fixture);

  fixture_initialize(&fixture, BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
                      BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  memset(&malformed, 0, sizeof(malformed));
  malformed.generation = fixture.gateway.connection_generation;
  malformed.size = sizeof(malformed.data) + 1;
  assert(bkvoice_gateway_dispatch_frame(&fixture.gateway, &malformed) ==
         -EMSGSIZE);
  fixture_finish(&fixture);
}

static void test_volume_dispatch(void)
{
  struct fixture_s fixture;
  struct bkvoice_companion_header_s header;
  const uint8_t *payload;
  uint8_t requested[4];
  size_t offset;
  int i;

  fixture_initialize_volume(&fixture, 640, 640, true);
  assert(fake_tx_header(&fixture.transport, 0).payload_len == 4);
  assert(test_get_be32(fixture.transport.tx + BKVOICE_COMPANION_HEADER_BYTES) ==
         (BKVOICE_COMPANION_CAP_VOLUME |
          BKVOICE_COMPANION_CAP_PLAYBACK_ACK |
          BKVOICE_COMPANION_CAP_STATUS_REPORT));
  for (i = 0; i < 3; i++)
    {
      fixture.owner.volume = i == 2 ? 101 : 67;
      fixture.owner.volume_error = i == 1 ? -EBUSY : 0;
      offset = fixture.transport.tx_size;
      test_put_be32(requested, 65);
      fixture_enqueue_server(&fixture, BKVOICE_COMPANION_VOLUME_SET, 0, 0,
                              requested, sizeof(requested));
      assert(bkvoice_gateway_receive_one(&fixture.gateway, 700) == 0);
      assert(fixture.owner.requested_volume == 65);
      assert(bkvoice_companion_decode(fixture.transport.tx + offset,
               fixture.transport.tx_size - offset, &header, &payload) == 0);
      assert(header.type == BKVOICE_COMPANION_VOLUME_REPORT);
      assert(header.turn_id == 0);
      assert(test_get_be32(payload) == fixture.server_sequence);
      assert((int32_t)test_get_be32(payload + 4) ==
             (i == 1 ? -EBUSY : i == 2 ? -EIO : 0));
      assert(test_get_be32(payload + 8) == (i == 0 ? 67u : UINT32_MAX));
      assert(!fixture.gateway.faulted);
    }

  fixture_finish(&fixture);
}

