open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
static void test_status_report(void)
{
  struct bkvoice_gateway_status_s status;
  struct bkvoice_companion_header_s header;
  struct fixture_s fixture;
  const uint8_t *payload;
  size_t offset;

  fixture_initialize(&fixture, 640, 640);
  assert(test_get_be32(fixture.transport.tx +
                       BKVOICE_COMPANION_HEADER_BYTES) ==
         (BKVOICE_COMPANION_CAP_PLAYBACK_ACK |
          BKVOICE_COMPANION_CAP_STATUS_REPORT));
  memset(&status, 0, sizeof(status));
  status.battery_percent = BKVOICE_COMPANION_BATTERY_UNKNOWN;
  status.charging = 1;
  status.battery_state = BKVOICE_COMPANION_BATTERY_STATE_CHARGING;
  status.battery_voltage_mv = 3888;
  status.firmware_major = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_minor = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_revision = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_build = BKVOICE_COMPANION_FW_BUILD_UNKNOWN;

  offset = fixture.transport.tx_size;
  assert(bkvoice_gateway_report_status(&fixture.gateway, &status) == 0);
  assert(bkvoice_companion_decode(fixture.transport.tx + offset,
           fixture.transport.tx_size - offset, &header, &payload) == 0);
  assert(header.type == BKVOICE_COMPANION_STATUS_REPORT);
  assert(header.turn_id == 0 && header.flags == 0);
  assert(payload[0] == 1 && payload[1] == 0xff && payload[2] == 1 &&
         payload[3] == BKVOICE_COMPANION_BATTERY_STATE_CHARGING);
  assert(test_get_be32(payload + 4) == 3888);
  assert(test_get_be16(payload + 8) == UINT16_MAX);
  assert(test_get_be32(payload + 16) == UINT32_MAX);

  status.firmware_major = 18;
  status.firmware_minor = 6;
  status.firmware_revision = 389;
  status.firmware_build = 449;
  status.firmware_identity_valid = true;
  for (size_t index = 0; index < sizeof(status.firmware_root_sha256); index++)
    {
      status.firmware_root_sha256[index] = (uint8_t)(index + 1u);
    }
  offset = fixture.transport.tx_size;
  assert(bkvoice_gateway_report_status(&fixture.gateway, &status) == 0);
  assert(bkvoice_companion_decode(fixture.transport.tx + offset,
           fixture.transport.tx_size - offset, &header, &payload) == 0);
  assert(header.payload_len == BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES);
  assert(payload[0] == 2 && test_get_be16(payload + 8) == 18 &&
         test_get_be16(payload + 10) == 6 &&
         test_get_be16(payload + 12) == 389 &&
         test_get_be32(payload + 16) == 449);
  assert(memcmp(payload + BKVOICE_COMPANION_STATUS_REPORT_BYTES,
                status.firmware_root_sha256,
                sizeof(status.firmware_root_sha256)) == 0);

  memset(status.firmware_root_sha256, 0,
         sizeof(status.firmware_root_sha256));
  offset = fixture.transport.tx_size;
  assert(bkvoice_gateway_report_status(&fixture.gateway, &status) == -ERANGE);
  assert(fixture.transport.tx_size == offset);

  offset = fixture.transport.tx_size;
  status.firmware_identity_valid = false;
  status.charging = 0;
  assert(bkvoice_gateway_report_status(&fixture.gateway, &status) == -ERANGE);
  assert(fixture.transport.tx_size == offset);
  fixture_finish(&fixture);
}

static void test_ota_dispatch_and_reports(void)
{
  struct fixture_s fixture;
  struct bkvoice_companion_header_s header;
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_gateway_status_s status;
  const uint8_t *payload;
  uint8_t digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES];
  uint8_t other_digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES];
  size_t offset;

  memset(digest, 0x39, sizeof(digest));
  memset(other_digest, 0x3a, sizeof(other_digest));
  fixture_initialize_ota(&fixture, 640, 640);
  assert(test_get_be32(fixture.transport.tx + BKVOICE_COMPANION_HEADER_BYTES) ==
         (BKVOICE_COMPANION_CAP_PLAYBACK_ACK |
          BKVOICE_COMPANION_CAP_STATUS_REPORT |
          BKVOICE_COMPANION_CAP_OTA));

  offset = fixture.transport.tx_size;
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_OTA_REQUEST, 0, 0,
                         digest, sizeof(digest));
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 700) == 0);
  assert(fixture.owner.ota_calls == 1);
  assert(fixture.owner.ota_request_sequence == fixture.server_sequence);
  assert(memcmp(fixture.owner.ota_digest, digest, sizeof(digest)) == 0);
  assert(bkvoice_companion_decode(fixture.transport.tx + offset,
                                  fixture.transport.tx_size - offset,
                                  &header, &payload) == 0);
  assert(header.type == BKVOICE_COMPANION_OTA_REPORT && header.turn_id == 0);
  assert(test_get_be32(payload) == fixture.owner.ota_request_sequence);
  assert((int32_t)test_get_be32(payload + 4) == 0);
  assert(payload[8] == BKVOICE_COMPANION_OTA_DOWNLOADING && payload[9] == 0);
  assert(memcmp(payload + 12, digest, sizeof(digest)) == 0);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.ota_active && snapshot.ota_phase ==
         BKVOICE_COMPANION_OTA_DOWNLOADING);

  memset(&status, 0, sizeof(status));
  status.battery_percent = BKVOICE_COMPANION_BATTERY_UNKNOWN;
  status.charging = 1;
  status.battery_state = BKVOICE_COMPANION_BATTERY_STATE_CHARGING;
  status.battery_voltage_mv = 3800;
  status.firmware_major = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_minor = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_revision = BKVOICE_COMPANION_FW_UNKNOWN;
  status.firmware_build = BKVOICE_COMPANION_FW_BUILD_UNKNOWN;
  assert(bkvoice_gateway_report_status(&fixture.gateway, &status) == 0);

  offset = fixture.transport.tx_size;
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_OTA_REQUEST, 0, 0,
                         digest, sizeof(digest));
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 700) == -EBUSY);
  assert(bkvoice_companion_decode(fixture.transport.tx + offset,
                                  fixture.transport.tx_size - offset,
                                  &header, &payload) == 0);
  assert(header.type == BKVOICE_COMPANION_OTA_REPORT &&
         (int32_t)test_get_be32(payload + 4) == -EBUSY &&
         payload[8] == BKVOICE_COMPANION_OTA_FAILED);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(snapshot.ota_active && !snapshot.faulted &&
         snapshot.rx_sequence == fixture.server_sequence);

  offset = fixture.transport.tx_size;
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence + 1u,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_VERIFYING, 1) ==
         -EINVAL);
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     other_digest, 0,
                                     BKVOICE_COMPANION_OTA_VERIFYING, 1) ==
         -EINVAL);
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_FAILED, 1) ==
         -EINVAL);
  assert(fixture.transport.tx_size == offset);

  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_VERIFYING, 1) == 0);
  offset = fixture.transport.tx_size;
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_DOWNLOADING, 2) ==
         -EINVAL);
  assert(fixture.transport.tx_size == offset);
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_STAGED, 100) == 0);
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_REBOOTING, 100) == 0);
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_TRIAL, 100) == 0);
  assert(bkvoice_gateway_report_ota(&fixture.gateway,
                                     fixture.owner.ota_request_sequence,
                                     digest, 0,
                                     BKVOICE_COMPANION_OTA_CONFIRMED, 100) == 0);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(!snapshot.ota_active);

  fixture.owner.ota_error = -EPERM;
  offset = fixture.transport.tx_size;
  fixture_enqueue_server(&fixture, BKVOICE_COMPANION_OTA_REQUEST, 0, 0,
                         digest, sizeof(digest));
  assert(bkvoice_gateway_receive_one(&fixture.gateway, 701) == 0);
  assert(bkvoice_companion_decode(fixture.transport.tx + offset,
                                  fixture.transport.tx_size - offset,
                                  &header, &payload) == 0);
  assert(header.type == BKVOICE_COMPANION_OTA_REPORT);
  assert((int32_t)test_get_be32(payload + 4) == -EPERM);
  assert(payload[8] == BKVOICE_COMPANION_OTA_FAILED);
  bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
  assert(!snapshot.ota_active && fixture.owner.ota_calls == 2);
  fixture_finish(&fixture);
}

