open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_gateway.c
static void test_ota_request_busy_voice_states(void)
{
  static const enum bkvoice_companion_state_e states[] =
  {
    BKVOICE_COMPANION_UPLINK,
    BKVOICE_COMPANION_THINKING,
    BKVOICE_COMPANION_DOWNLINK,
  };
  struct fixture_s fixture;
  struct bkvoice_gateway_snapshot_s snapshot;
  struct bkvoice_companion_header_s header;
  const uint8_t *payload;
  uint8_t digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES];
  size_t index;
  size_t offset;

  memset(digest, 0x4d, sizeof(digest));
  for (index = 0; index < sizeof(states) / sizeof(states[0]); index++)
    {
      fixture_initialize_ota(&fixture, 640, 640);
      fixture.gateway.companion.state = states[index];
      fixture.gateway.companion.turn_id = 1;
      offset = fixture.transport.tx_size;
      fixture_enqueue_server(&fixture, BKVOICE_COMPANION_OTA_REQUEST, 0, 0,
                             digest, sizeof(digest));
      assert(bkvoice_gateway_receive_one(&fixture.gateway, 700) == -EBUSY);
      assert(fixture.owner.ota_calls == 0);
      assert(bkvoice_companion_decode(fixture.transport.tx + offset,
                                      fixture.transport.tx_size - offset,
                                      &header, &payload) == 0);
      assert(header.type == BKVOICE_COMPANION_OTA_REPORT &&
             header.turn_id == 0 && test_get_be32(payload) ==
             fixture.server_sequence &&
             (int32_t)test_get_be32(payload + 4) == -EBUSY &&
             payload[8] == BKVOICE_COMPANION_OTA_FAILED &&
             memcmp(payload + 12, digest, sizeof(digest)) == 0);
      bkvoice_gateway_snapshot(&fixture.gateway, &snapshot);
      assert(!snapshot.faulted && !snapshot.ota_active &&
             snapshot.companion_state == states[index]);
      fixture.gateway.companion.state = BKVOICE_COMPANION_IDLE;
      fixture.gateway.companion.turn_id = 0;
      fixture_finish(&fixture);
    }
}

int main(void)
{
  test_split_stale_frames_and_generation_limit();
  test_split_length_error_is_deferred();
  test_transport_guards();
  test_volume_dispatch();
  test_status_report();
  test_ota_dispatch_and_reports();
  test_ota_request_busy_voice_states();
  test_single_turn_vertical();
  test_downlink_credit_replenished_after_dac_accept();
  test_rejected_downlink_does_not_replenish_credit();
  test_downlink_credit_send_failure_faults_session();
  test_backpressure_retry_and_local_cancel();
  test_remote_cancel_dispatch();
  test_partial_send_failure_and_close_retry();
  test_sequence_gap_and_receive_timeout_fail_closed();
  puts("BKVOICE_GATEWAY_HOST_PASS");
  return 0;
}
